<?php

use App\Dua;
use Illuminate\Database\Seeder;

class DuasTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $dua1 = new Dua();
        $dua1->title = 'কাপড় পরিধানের দো‘আ';
        $str = strtolower($dua1->title);
        $dua1->slug = preg_replace('/\s+/', '-', $str);
        $dua1->arabic = 'الْحَمْدُ لِلَّهِ الَّذِي كَسَانِي هَذَا (الثَّوْبَ) وَرَزَقَنِيهِ مِنْ غَيْرِ حَوْلٍ مِنِّي وَلاَ قُوَّةٍ';
        $dua1->translation = 'সকল হামদ-প্রশংসা আল্লাহ্‌র জন্য; যিনি আমাকে এ (কাপড়)টি পরিধান করিয়েছেন এবং আমার শক্তি-সামর্থ্য ছাড়াই তিনি আমাকে এটা দান করেছেন';
        $dua1->transliteration = 'আল্‌হামদু লিল্লা-হিল্লাযী কাসানী হা-যা (আসসাওবা) ওয়া রযাকানীহি মিন্ গইরি হাওলিম মিন্নী ওয়ালা কুওওয়াতিন';
        $dua1->audio_url = 'https://download.quranicaudio.com/quran/salaah_bukhaatir/114.mp3';
        $dua1->reference = 'আবূ দাউদ, নং ৪০২৩; তিরমিযী, নং ৩৪৫৮; ইবন মাজাহ্‌, নং ৩২৮৫। আর শাইখ আলবানী একে হাসান বলেছেন। দেখুন, ইরওয়াউল গালীল, ৭/৪৭।';
        $dua1->save();


        $dua2 = new Dua();
        $dua2->title = 'বাড়ি থেকে বের হওয়ার সময়ের যিকর';
        $str = strtolower($dua2->title);
        $dua2->slug = preg_replace('/\s+/', '-', $str);
        $dua2->arabic = 'بِسْمِ اللَّهِ، تَوَكَّلْتُ عَلَى اللَّهِ، وَلَا حَوْلَ وَلَا قُوَّةَ إِلاَّ بِاللَّهِ';
        $dua2->translation = 'আল্লাহ্‌র নামে (বের হচ্ছি)। আল্লাহর উপর ভরসা করলাম। আর আল্লাহর সাহায্য ছাড়া (পাপ কাজ থেকে দূরে থাকার) কোনো উপায় এবং (সৎকাজ করার) কোনো শক্তি কারো নেই';
        $dua2->transliteration = 'বিসমিল্লাহি, তাওয়াককালতু ‘আলাল্লা-হি, ওয়ালা হাওলা ওয়ালা কুওয়াতা ইল্লা বিল্লাহ';
        $dua2->reference = 'আবূ দাউদ ৪/৩২৫, নং ৫০৯৫; তিরমিযী ৫/৪৯০, ৩৪২৬। আরও দেখুন, সহীহুত তিরমিযী, ৩/১৫১।';
        $dua2->audio_url = 'https://download.quranicaudio.com/quran/salaah_bukhaatir/111.mp3';
        $dua2->save();
        
        $dua3 = new Dua();
        $dua3->title = 'ঋণ মুক্তির জন্য দো‘আ';
        $str = strtolower($dua3->title);
        $dua3->slug = preg_replace('/\s+/', '-', $str);
        $dua3->arabic = 'اللَّهُمَّ اكْفِنِي بِحَلاَلِكَ عَنْ حَرَامِكَ، وَأَغْنِنِي بِفَضْلِكَ عَمَّنْ سِوَاكَ';
        $dua3->translation = 'হে আল্লাহ! আপনি আমাকে আপনার হালাল দ্বারা পরিতুষ্ট করে আপনার হারাম থেকে ফিরিয়ে রাখুন এবং আপনার অনুগ্রহ দ্বারা আপনি ছাড়া অন্য সকলের থেকে আমাকে অমুখাপেক্ষী করে দিন।';
        $dua3->transliteration = 'আল্লা-হুম্মাকফিনী বিহালা-লিকা ‘আন হারা-মিকা ওয়া আগনিনী বিফাদ্বলিকা ‘আম্মান সিওয়া-ক';
        $dua3->reference = 'তিরমিযী ৫/৫৬০, নং ৩৫৬৩। আরও দেখুন, সহীহুত তিরমিযী, ৩/১৮০।';
        $dua3->audio_url = 'https://download.quranicaudio.com/quran/salaah_bukhaatir/112.mp3';
        $dua3->save();

        $dua4 = new Dua();
        $dua4->title = 'মসজিদে প্রবেশের দো‘আ';
        $str = strtolower($dua4->title);
        $dua4->slug = preg_replace('/\s+/', '-', $str);
        $dua4->arabic = 'اللَّهُمَّ افْتَحْ لِي أَبْوَابَ رَحْمَتِكَ';
        $dua4->translation = 'হে আল্লাহ! আপনি আমার জন্য আপনার রহমতের দরজাসমূহ খুলে দিন';
        $dua4->transliteration = 'আল্লা-হুম্মাফ্‌তাহ লী আবওয়া-বা রাহ্‌মাতিকা';
        $dua4->reference = 'মুসলিম ১/৪৯৪, নং ৭১৩; আর সুনান ইবন মাজায় ফাতিমা রাদিয়াল্লাহু আনহার হাদীসে এসেছে, “হে আল্লাহ, আমার গুনাহ ক্ষমা করে দিন এবং আমার জন্য আপনার রহমতের দ্বারসমূহ অবারিত করে দিন”। আর শাইখ আলবানী অন্যান্য শাহেদ বা সম অর্থের বর্ণনার কারণে একে সহীহ বলেছেন। দেখুন, সহীহ ইবন মাজাহ্ ১/১২৮-১২৯।';
        $dua4->audio_url = 'https://download.quranicaudio.com/quran/salaah_bukhaatir/112.mp3';
        $dua4->save();

        $dua5 = new Dua();
        $dua5->title = 'মসজিদ থেকে বের হওয়ার দো‘আ';
        $str = strtolower($dua5->title);
        $dua5->slug = preg_replace('/\s+/', '-', $str);
        $dua5->arabic = 'بِسْمِ اللَّهِ وَالصّلَاةُ وَالسَّلَامُ عَلَى رَسُولِ اللَّهِ، اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ فَضْلِك، اللَّهُمَّ اعْصِمْنِي مِنَ الشَّيْطَانِ الرَّجِيمِ،';
        $dua5->translation = 'আল্লাহ্‌র নামে (বের হচ্ছি)। আল্লাহ্‌র রাসুলের উপর শান্তি বর্ষিত হোক। হে আল্লাহ! আপনি আমার গুনাসমূহ মাফ করে দিন এবং আমার জন্য আপনার দয়ার দরজাগুলো খুলে দিন। হে আল্লাহ, আমাকে বিতাড়িত শয়তান থেকে হেফাযত করুন';
        $dua5->transliteration = 'বিস্‌মিল্লা-হি ওয়াস্‌সালা-তু ওয়াস্‌সালা-মু ‘আলা রাসূলিল্লাহ, আল্লা-হুম্মা ইন্নী আসআলুকা মিন ফাদ্বলিকা, আল্লা-হুম্মা আ‘সিমনি মিনাশ শাইত্বানির রাজীম।';
        $dua5->reference = '[১] আল-হাকিম, ১/২১৮; বাইহাকী, ২/৪৪২, আর শাইখ আলবানী তার সিলসিলাতুস সহীহায় একে হাসান হাদীস বলেছেন, ৫/৬২৪, নং ২৪৭৮। আর সেটার তাখরীজ পূর্বে গত হয়েছে। [২] মসজিদে প্রবেশের দো‘আয় পূর্বে বর্ণিত হাদীসের রেওয়ায়েতসমূহের তাখরীজ দেখুন, (২০ নং) আর “হে আল্লাহ, আমাকে বিতাড়িত শয়তান থেকে হেফাযত করুন” এ বাড়তি অংশের তাখরীজ দেখুন, ইবন মাজাহ্‌ ১/১২৯।';
        $dua5->audio_url = 'https://download.quranicaudio.com/quran/salaah_bukhaatir/112.mp3';
        $dua5->save();


        $dua6 = new Dua();
        $dua6->title = 'জাহান্নামের আগুন থেকে মুক্তি';
        $str = strtolower($dua6->title);
        $dua6->slug = preg_replace('/\s+/', '-', $str);
        $dua6->arabic = 'اللَّهُمَّ إِنّيْ أَصْبَحْتُ (أَمْسَيْتُ) أُشْهِدُكَ، وَأُشْهِدُ حَمَلَةَ عَرْشِكَ، وَمَلاَئِكَتِكَ، وَجَمِيعَ خَلْقِكَ، أَنَّكَ أَنْتَ اللَّهُ لَا إِلَهَ إِلاَّ أَنْتَ وَحْدَكَ لاَ شَرِيكَ لَكَ، وَأَنَّ مُحَمَّدًا عَبْدُكَ وَرَسُولُكَ';
        $dua6->translation = 'হে আল্লাহ! আমি সকালে (বিকালে) উপনীত হয়েছি। আপনাকে আমি সাক্ষী রাখছি, আরও সাক্ষী রাখছি আপনার ‘আরশ বহনকারীদেরকে, আপনার ফেরেশতাগণকে ও আপনার সকল সৃষ্টিকে, (এর উপর) যে— নিশ্চয় আপনিই আল্লাহ, একমাত্র আপনি ছাড়া আর কোন হক্ব ইলাহ নেই, আপনার কোনো শরীক নেই; আর মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আপনার বান্দা ও রাসূল।';
        $dua6->transliteration = 'আল্লা-হুম্মা ইন্নী আসবাহ্‌তু (আমসাইতু) উশহিদুকা ওয়া উশহিদু হামালাতা ‘আরশিকা ওয়া মালা-ইকাতিকা ওয়া জামী‘আ খালক্বিকা, আন্নাকা আনতাল্লা-হু লা ইলা-হা ইল্লা আনতা ওয়াহ্‌দাকা লা শারীকা লাকা, ওয়া আন্না মুহাম্মাদান আব্দুকা ওয়া রাসূলুকা';
        $dua6->reference = 'আবূ দাউদ ৪/৩১৭, নং ৫০৭১; বুখারী, আল-আদাবুল মুফরাদ, নং ১২০১; নাসাঈ, ‘আমালুল ইয়াওমি ওয়াল লাইলাহ, নং ৯; ইবনুস সুন্নী, নং ৭০। সম্মানিত শাইখ আবদুল আযীয ইবন বায রাহেমাহুল্লাহ তাঁর তুহফাতুল আখইয়ার গ্রন্থের পৃ. ২৩ এ নাসাঈ ও আবূ দাউদের সনদকে হাসান বলেছেন।';
        $dua6->audio_url = 'https://download.quranicaudio.com/quran/salaah_bukhaatir/112.mp3';
        $dua6->save();


        $dua7 = new Dua();
        $dua7->title = 'কোনো মুসিবতে পতিত ব্যক্তির দো‘আ';
        $str = strtolower($dua7->title);
        $dua7->slug = preg_replace('/\s+/', '-', $str);
        $dua7->arabic = 'إِنَّا لِلَّهِ وَإِنَّا إِلَيْهِ رَاجِعُونَ، اللَّهُمَّ أْجُرْنِي فِي مُصِيبَتِي، وَأَخْلِفْ لِي خَيْرًا مِنْهَا';
        $dua7->translation = 'আমরা তো আল্লাহ্‌রই। আর নিশ্চয় আমরা তাঁর দিকেই প্রত্যাবর্তনকারী। হে আল্লাহ! আমাকে আমার বিপদে সওয়াব দিন এবং আমার জন্য তার চেয়েও উত্তম কিছু স্থলাভিষিক্ত করে দিন।';
        $dua7->transliteration = 'ইন্না লিল্লা-হি ওয়া ইন্না ইলাইহি রাজি‘উন। আল্লা-হুম্মা আজুরনী ফী মুসীবাতী ওয়াখলুফ লী খাইরাম মিনহা';
        $dua7->reference = 'মুসলিম ২/৬৩২, নং ৯১৮।';
        $dua7->audio_url = 'https://download.quranicaudio.com/quran/salaah_bukhaatir/112.mp3';
        $dua7->save();

        $dua8 = new Dua();
        $dua8->title = 'বৃষ্টি দেখলে দো‘আ';
        $str = strtolower($dua8->title);
        $dua8->slug = preg_replace('/\s+/', '-', $str);
        $dua8->arabic = 'اللَّهُمَّ صَيِّباً نَافِعاً';
        $dua8->translation = 'হে আল্লাহ! মুষলধারায় উপকারী বৃষ্টি বর্ষণ করুন।';
        $dua8->transliteration = 'আল্লা-হুম্মা সায়্যিবান নাফি‘আন';
        $dua8->reference = 'বুখারী, (ফাতহুল বারীসহ) ২/৫১৮, নং ১০৩২।';
        $dua8->audio_url = 'https://download.quranicaudio.com/quran/salaah_bukhaatir/112.mp3';
        $dua8->save();

        $dua9 = new Dua();
        $dua9->title = 'নতুন চাঁদ দেখে পড়ার দো‘আ';
        $str = strtolower($dua9->title);
        $dua9->slug = preg_replace('/\s+/', '-', $str);
        $dua9->arabic = 'اللَّهُ أَكْبَرُ، اللَّهُمَّ أَهِلَّهُ عَلَيْنَا بِالْأَمْنِ وَالْإِيمَانِ، وَالسَّلاَمَةِ وَالْإِسْلاَمِ، وَالتَّوْفِيقِ لِمَا تُحِبُّ رَبَّنَا وَتَرْضَى، رَبُّنَا وَرَبُّكَ اللَّهُ';
        $dua9->translation = '     আল্লাহ সবচেয়ে বড়। হে আল্লাহ! এই নতুন চাঁদকে আমাদের উপর উদিত করুন নিরাপত্তা, ঈমান, শান্তি ও ইসলামের সাথে; আর হে আমাদের রব্ব! যা আপনি পছন্দ করেন এবং যাতে আপনি সন্তুষ্ট হন তার প্রতি তাওফীক লাভের সাথে। আল্লাহ আমাদের রব্ব এবং তোমার (চাঁদের) রব্ব।';
        $dua9->transliteration = 'আল্লা-হু আকবার, আল্লা-হুম্মা আহিল্লাহু ‘আলাইনা বিলআমনি ওয়ালঈমানি ওয়াস্‌সালা-মাতি ওয়াল-ইসলা-মি, ওয়াত্তাওফীকি লিমা তুহিব্বু রব্বানা ওয়া তারদ্বা, রব্বুনা ওয়া রব্বুকাল্লাহ';
        $dua9->reference = 'তিরমিযী ৫/৫০৪, নং ৩৪৫১; আদ-দারিমী, শব্দ তাঁরই, ১/৩৩৬। আরও দেখুন, সহীহুত তিরমিযী, ৩/১৫৭।';
        $dua9->audio_url = 'https://download.quranicaudio.com/quran/salaah_bukhaatir/112.mp3';
        $dua9->save();


        $dua10 = new Dua();
        $dua10->title = 'লাইলাতুল ক্বদরের দোআ';
        $str = strtolower($dua10->title);
        $dua10->slug = preg_replace('/\s+/', '-', $str);
        $dua10->arabic = 'اللَّهُمَّ إِنَّكَ عَفُوٌّ تُحِبُّ الْعَفْوَ فَاعْفُ عَنِّي';
        $dua10->translation = 'হে আল্লাহ! তুমি ক্ষমাকারী, তুমি মাফ করতেই পছন্দ কর, অতএব তুমি আমাকে মাফ করে দাও';
        $dua10->transliteration = "আল্লাহুম্মা ইন্নাকা 'আফুউন, তু'হিব্বুল 'আফওয়া, ফা'ফু 'আন্নী";
        $dua10->reference = 'সুনান ইবনে মাজাহ, বই ৩৪ , হাদিস ২৪';
        $dua10->audio_url = 'https://download.quranicaudio.com/quran/salaah_bukhaatir/112.mp3';
        $dua10->save();

        $dua10 = new Dua();
        $dua10->title = 'পাপ করার পর ক্ষমা প্রার্থনা ';
        $str = strtolower($dua10->title);
        $dua10->slug = preg_replace('/\s+/', '-', $str);
        $dua10->arabic = 'رَبَّنَا ظَلَمْنَا أَنفُسَنَا وَإِن لَّمْ تَغْفِرْ لَنَا وَتَرْحَمْنَا لَنَكُونَنَّ مِنَ الْخَاسِرِينَ';
        $dua10->translation = 'হে আমাদের রব, আমরা নিজদের উপর যুল্‌ম করেছি। আর যদি আপনি আমাদেরকে ক্ষমা না করেন এবং আমাদেরকে দয়া না করেন তবে অবশ্যই আমরা ক্ষতিগ্রস্তদের অন্তর্ভুক্ত হব';
        $dua10->transliteration ="রব্বানা- জোয়ালাম্না- আন্ফুসানা- অইল্লাম্ তার্গ্ফিলানা-অর্তাহাম্না-লানাকূনান্না মিনাল্ খা-সিরীন্।";
        $dua10->reference = 'সূরা আল আরাফ - ৭:২৩';
        $dua10->audio_url = 'https://download.quranicaudio.com/quran/salaah_bukhaatir/112.mp3';
        $dua10->save();

    }
}
